[{
  "_id": {
    "$oid": "652e2641b369bd86712647e8"
  },
  "origen": "https://www.youtube.com/watch?v=4ZdaEdo73cs",
  "nombre": "Pollo al limón",
  "pasos": "Preparar las verduras\nCortar las cabezas de brócoli en floretes del mismo tamaño\nQuitar las capas exteriores del tallo del brócoli y cortar en trozos del mismo tamaño que los floretes\nDescartar la parte inferior del tallo del brócoli\nEliminar las puntas y los extremos de las judías verdes\nCortar los limones por la mitad y exprimir su jugo\nPreparar la salsa mezclando caldo de pollo, ajo, jugo de limón, miel, cebolla en polvo, salsa de soja, aceite de sésamo y almidón de maíz\nCocinar el arroz siguiendo las indicaciones de cocción en agua con sal\nSaltear el brócoli y las judías verdes en una sartén con aceite de oliva\nAñadir agua y tapar para cocinar al vapor por unos minutos\nTransferir las verduras cocidas a un plato\nCocinar el pollo en una sartén con aceite de oliva hasta que esté completamente cocido y dorado\nAgregar la salsa al pollo y cocinar por unos minutos hasta que espese\nAñadir semillas de sésamo y ajustar el sazón con sal y pimienta\nServir el pollo con las verduras y el arroz\nDisfrutar de la deliciosa receta de pollo al limón\n",
  "ingredientes": [
    {
      "Ingrediente": "broccoli",
      "Cantidad": "2 cabezas"
    },
    {
      "Ingrediente": "judías verdes",
      "Cantidad": "250 gramos"
    },
    {
      "Ingrediente": "limones",
      "Cantidad": "2 unidades"
    },
    {
      "Ingrediente": "pollo sin piel ni huesos",
      "Cantidad": "1 kilogramo"
    },
    {
      "Ingrediente": "caldo de pollo",
      "Cantidad": "125 ml"
    },
    {
      "Ingrediente": "ajo",
      "Cantidad": "3 dientes"
    },
    {
      "Ingrediente": "miel",
      "Cantidad": "80 ml"
    },
    {
      "Ingrediente": "polvo de cebolla",
      "Cantidad": "2.5 gramos"
    },
    {
      "Ingrediente": "salsa de soja",
      "Cantidad": "30 ml"
    },
    {
      "Ingrediente": "aceite de sésamo",
      "Cantidad": "10 ml"
    },
    {
      "Ingrediente": "harina de maíz",
      "Cantidad": "12 gramos"
    },
    {
      "Ingrediente": "arroz basmati",
      "Cantidad": "350 gramos"
    },
    {
      "Ingrediente": "agua",
      "Cantidad": "700 ml"
    },
    {
      "Ingrediente": "aceite de oliva",
      "Cantidad": "30 ml"
    },
    {
      "Ingrediente": "sal marina",
      "Cantidad": "al gusto"
    },
    {
      "Ingrediente": "pimienta negra",
      "Cantidad": "al gusto"
    },
    {
      "Ingrediente": "semillas de sésamo blanco",
      "Cantidad": "5 gramos"
    },
    {
      "Ingrediente": "semillas de sésamo negro",
      "Cantidad": "5 gramos"
    }
  ],
  "img": "static/img/4ZdaEdo73cs.jpg",
  "texto": "This episode is all about lemon chicken, it is a fantastic recipe make, it's being served with some pan-fried vegetables and of course soft fluffy rice and all-way conversions, ingredients, substitutes and nutrition values are listed in the description. Starting out, we're going get the most out of two heads of broccoli, we're going use a sharp tearing knife and just run it around the stem just remove the florets into nice bite-sized pieces. You may have some pieces that are bigger than the others so we're just going trim them up, making sure that they're all the same size and this will just that everything cooks at the same time and temperature. With the stem definitely don't throw this away, this is packed with sweet flavor and obviously lots of nutrition, we can just remove the outer layers because these can be a little bit woody, I prefer use them old, you can throw them away, some people do find them bitter and then we're just going trim this up into bite-sized pieces, preferably the same size as the florets. If you didn't want use these in this recipe, you can also save them, freeze them and use them in soups in the future. With the bottom of the broccoli stem though, I do recommend throwing this away as it's really bitter and quite hard, but other than that this is all that needs be done. Next is 250 grams of washed green beans, all we need do with these is remove the top and tail of them, they can be a bit hard, obviously it contains the stem too, it's up you how you want do this and you can leave them whole or chop them in half. Now with the veg out the way, we're going need two lemons for our sauce, these can both just be sliced in half and then juiced on a citrus juicer or by hand, just make sure seeds decide hop in because it's definitely not having seeds in your sauce. Last but not least swap out your board a board dedicate chicken, slap down one kilo of boneless and skinless chicken thigh, slice this into nice strips, then dice into bite-sized pieces. Obviously this right here isn't one kilo of chicken, but this right here is. Now make our sauce, add 125 ml of chicken stock a small mixing bowl, along with three cloves of garlic that can be ran along a microplane create a paste and you can also put this along a fine box grater. Next we're going add in the juice of both of those lemons, 80 ml of honey which I've put in the microwave for about 20 seconds just loosen it up, two and a half grams of onion powder for a strong concentrated flavour, 30 ml of soy sauce for a salty umami flavour, 10 ml of sesame oil for a strong nutty flavour and 12 grams of corn flour, which will help thicken this up once it reaches the heat. Let's then get in there of a whisk and mix this up just until everything is combined and that corn flour is broken down, test if it's seasoning and adjust if necessary with sea salt flakes and cracked black pepper, 10 grams of fff. Get back in there again with the whisk and mix this combine. As for cooking, place a large saucepan over high heat, add in 350 grams of washed basmati rice, 700 ml of cold water which is a 2-1 ratio and sea salt flakes taste, then just give this a mix around prevent any clumps from forming and bring it a boil. Once boiling, place on a lid and lower the heat low and cook for 14 minutes under-stirbed. In the meantime, place a large pan over medium-high heat, add in 30 ml of olive oil and then dump in the broccoli as well as the stems, a pinch of sea salt flakes taste and saute this for 3-4 minutes just until the broccoli starts gain a nice golden brown colour. You also don't have use broccoli if you're not a fan, you can use a whole wide range of all of your favourite different vegetables. Now after 4 minutes and our broccoli softened up and starting gain nice colour, let's add in the green beans and continue sauteing for about 3 minutes, just mixing it through regularly. We can also add in some cracked black pepper at this stage. Follow that up with 80 ml of water, this is going allow it steam, we can then place on a lid and allow it cook for 2 minutes before removing the lid, mix it around and what you should have is perfectly cooked vegetables which are soft but still do have a nice bite them. Remove this from the stove top and transfer the veg into a bowl or plate or whatever you have and we're going reuse the pan save dishes and this right here is the macros for 5 individual servings. After 14 minutes we can go back the rice, turn it off the heat and leave the lid on for a final 4 minutes before removing it and fluff it up with a fork or spatula leaving us with this perfect soft fluffy rice and these are all the macros for 5 individual 210 g servings. Now the best part is the honey chicken so it plays the same pan back over a high heat, add in 20 ml of olive oil and slide in your thighs, spread them out evenly across the bottom of the pan, this is going that they get really nice colour all over and cook evenly, season taste with sea salt flakes, then mix and cook regularly for 10 minutes which will cook the chicken all the way through and gain really nice colour and flavour. After 10 minutes give it another mix through nothing is stuck and that chicken is cooked through and has nice colour, add in all of the sauce mixture and then again mix this for 1.5 2 minutes and during this process it will come a boil and the corn vial will react the heat and thicken the sauce going everything really well. This is completely optional but I'm adding in 5 grams of both white and black sesame seeds for a nice pop of colour, also check in it for seasoning with sea salt flakes and crack black pepper, then mix this through just for about 20 seconds just until that sauce is completely thick and preferably don't set your tea towel on fire luck I did here. Also this is all of the nutrition values for 200 grams or 5 servings of the lemon chicken. With serving, if we look back throughout the video on those nutrition cards I've put it down as 210 grams of rice, 130 grams of the veg mix and 200 grams of the honey chicken but you might want lower those amounts and get 6 or 7 portions out of this. I am also going sprinkle over some black sesame seeds on the rice give it a nice pop of colour but with all of that done we have just created these absolutely incredible lemon chickens that are perfect for pretty much any occasion. As for storage we can place on the lid and get these in the fridge as soon as possible where they'll last 4 days and 4 months in the freezer but if you're using the mill prop containers that I have you can use the vacuum seal pump make these last 5 days in the fridge. This is the complete dish nutrition values for all of those weights that I said just before but with all of that done we can then dig in. Now I made this a couple of times the sauce wasn't as good in those previous times but this is absolutely perfect the consistency is just right and coats the chicken really well and obviously the flavour is incredible too. The vegetables obviously just vegetables you can swap and change and all of the few things about that in the description and the rice is super soft and fluffy. Overall this combination works absolutely perfectly and I really hope you enjoy it."
},
{
  "_id": {
    "$oid": "652e27b5b369bd86712647e9"
  },
  "origen": "https://www.youtube.com/watch?v=qExC-Sl2zLo",
  "nombre": "Hollandaise Sauce",
  "pasos": "Para comenzar, usar una cacerola pequeña con un cuarto de agua y llevarla a hervir.\nUna vez que el agua hierva, reducir el fuego a fuego lento.\nColocar los huevos sobre el baño de agua, agregar el vinagre blanco y batir.\nEvitar que los huevos se calienten demasiado para evitar que se cuajen, retirar del fuego cada 10 segundos.\nContinuar batiendo con movimientos en forma de ocho con el batidor.\nA medida que se cocine, la salsa se espesará. Comenzar cuando tenga consistencia de cintas.\nVerificar que la salsa esté lo suficientemente espesa y sin grumos, detener la cocción.\nVerter la mantequilla en forma lenta y constante para evitar que se corte la salsa.\nContinuar batiendo mientras se agrega la mantequilla, la salsa espesará aún más.\nCuando la salsa tenga una consistencia espesa y brillante, está lista para servir.\n",
  "ingredientes": [
    {
      "Ingrediente": "yemas de huevo",
      "Cantidad": "3"
    },
    {
      "Ingrediente": "vinagre blanco",
      "Cantidad": "1.5 cucharadas"
    },
    {
      "Ingrediente": "mantequilla clarificada",
      "Cantidad": "2 cucharadas"
    },
    {
      "Ingrediente": "sal",
      "Cantidad": "una pizca"
    },
    {
      "Ingrediente": "tocineta crujiente",
      "Cantidad": "al gusto"
    },
    {
      "Ingrediente": "huevos pochados",
      "Cantidad": "al gusto"
    }
  ],
  "img": "static/img/qExC-Sl2zLo.jpg",
  "texto": "Hello and welcome back my channel. In today's video I'm going show you how make holandais sauce. The ingredients that you're going need for this recipe is three egg yolks, one and a half tablespoons of white vinegar and two tablespoons of clarified butter. start this recipe we'll use a small saucepan with a quarter full of water and bring it a boil. Now that your pot has come a boil we're just going reduce the heat a simmer. You then want place the eggs over the water bath or as in cooking terms a baymory, add the white vinegar and whisk. You don't want this get too hot as the eggs will start curdling. So I like colour off the heat every 10 seconds. Just keep whisking. The best method do this is do and figure eight motions with the whisk. And as you go the stove you'll notice the sauce will eventually thicken up. And when you get the consistency of ribbons forming that's when you start. And you'll notice that this is started get a little bit thicker now. And at this stage when I can see the bottom of the bowl and the ribbons are forming nice thick ribbons I'm going stop. Then that's what you should end up with. So when you're pouring in the butter you just want go in a slow stream. Adding too much can cause this split. And you always want keep whisking and when adding the butter. And when adding the butter the butter will thicken up the sauce. And you should end up with something like that. Nice thick buttery glossy colour of those and at this stage if you're going serve the Hollandaise sauce with the eggs you can then fill up this pot the amount of water you need poach eggs. And if you haven't seen that video please check out the video that I've done on how poach eggs. Now the Hollandaise sauce is made I'm just going hit it with a pinch of salt. And now that's ready serve. And now it's time serve up. I've got some crispy bacon here. My poached eggs. And then I'm going spoon over that delicious Hollandaise. Thank you all for watching this video. I really hope you learnt something. If you could all please like, subscribe, share and comment down below what you think. And if anyone would like see any recipes please let know in the comment section below and I'll be sure make them. Thank you for watching. Bye. you"
}]